; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__uclibc_locale_struct.193 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.192 }
%struct.__collate_t.192 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.560 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.560*, [2 x i32], %struct.__mbstate_t.559, i8* }
%struct.__mbstate_t.559 = type { i32, i32 }
%struct.EFI_GCD_MEMORY_SPACE_DESCRIPTOR = type { i64, i64, i64, i64, i32, i8*, i8* }
%struct.EFI_MEMORY_ATTRIBUTES_TABLE = type { i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 299, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 298, type: !55, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!54 = !DIFile(filename: "klee/runtime/POSIX/fd.c", directory: "/home/mdshafiuzzaman/Research/KLEE")
!55 = !DISubroutineType(types: !56)
!56 = !{!45, !45}
!57 = distinct !DICompileUnit(language: DW_LANG_C89, file: !58, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !80, globals: !139, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "/home/mdshafiuzzaman/Research/KLEE/klee/runtime/POSIX/fd.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee_build/runtime/POSIX")
!59 = !{!60, !68}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 58, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "klee/runtime/POSIX/fd.h", directory: "/home/mdshafiuzzaman/Research/KLEE")
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, baseType: !62, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !6, !82, !10, !86, !7, !101, !45, !8}
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 92, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 149, baseType: !10)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 26, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "")
!104 = !{!105, !107, !109, !111, !113, !115, !117, !118, !119, !121, !123, !125, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 31, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 36, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 44, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 45, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !62)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 47, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 48, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !62)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 50, baseType: !45, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 52, baseType: !106, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 57, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !81)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 61, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 175, baseType: !81)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 63, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 180, baseType: !81)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 74, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 16, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 197, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 75, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 76, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 89, baseType: !136, size: 192, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !{!51, !140, !147, !154, !160, !165, !170}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "n_calls", scope: !142, file: !54, line: 331, type: !45, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 330, type: !143, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !45, !6, !23}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 108, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 194, baseType: !81)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "n_calls", scope: !149, file: !54, line: 397, type: !45, isLocal: true, isDefinition: true)
!149 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 396, type: !150, scopeLine: 396, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!150 = !DISubroutineType(types: !151)
!151 = !{!145, !45, !152, !23}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "n_calls", scope: !156, file: !54, line: 633, type: !45, isLocal: true, isDefinition: true)
!156 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 632, type: !157, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!157 = !DISubroutineType(types: !158)
!158 = !{!45, !29, !159}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 69, baseType: !112)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "n_calls", scope: !162, file: !54, line: 652, type: !45, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 651, type: !163, scopeLine: 651, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!163 = !DISubroutineType(types: !164)
!164 = !{!45, !45, !159}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "n_calls", scope: !167, file: !54, line: 738, type: !45, isLocal: true, isDefinition: true)
!167 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 737, type: !168, scopeLine: 737, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!168 = !DISubroutineType(types: !169)
!169 = !{!45, !45, !82}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "n_calls", scope: !172, file: !54, line: 1332, type: !45, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1331, type: !173, scopeLine: 1331, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!173 = !DISubroutineType(types: !174)
!174 = !{!7, !7, !23}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !177, file: !212, line: 375, type: !451, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !179, retainedTypes: !201, globals: !254, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!179 = !{!180, !186}
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 90, baseType: !62, size: 32, elements: !182)
!181 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!182 = !{!183, !184, !185}
!183 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!184 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!185 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !187, line: 48, baseType: !62, size: 32, elements: !188)
!187 = !DIFile(filename: "./include/ctype.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200}
!189 = !DIEnumerator(name: "_ISupper", value: 256)
!190 = !DIEnumerator(name: "_ISlower", value: 512)
!191 = !DIEnumerator(name: "_ISalpha", value: 1024)
!192 = !DIEnumerator(name: "_ISdigit", value: 2048)
!193 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!194 = !DIEnumerator(name: "_ISspace", value: 8192)
!195 = !DIEnumerator(name: "_ISprint", value: 16384)
!196 = !DIEnumerator(name: "_ISgraph", value: 32768)
!197 = !DIEnumerator(name: "_ISblank", value: 1)
!198 = !DIEnumerator(name: "_IScntrl", value: 2)
!199 = !DIEnumerator(name: "_ISpunct", value: 4)
!200 = !DIEnumerator(name: "_ISalnum", value: 8)
!201 = !{!45, !202, !7, !203, !205, !208, !96, !209, !210, !223, !231, !10}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !94)
!208 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !212, line: 400, baseType: !213)
!212 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 390, size: 128, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !213, file: !212, line: 391, baseType: !207, size: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !213, file: !212, line: 392, baseType: !207, size: 16, offset: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !213, file: !212, line: 393, baseType: !207, size: 16, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !213, file: !212, line: 394, baseType: !207, size: 16, offset: 48)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !213, file: !212, line: 396, baseType: !207, size: 16, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !213, file: !212, line: 397, baseType: !207, size: 16, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !213, file: !212, line: 398, baseType: !207, size: 16, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !213, file: !212, line: 399, baseType: !207, size: 16, offset: 112)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !212, line: 430, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 425, size: 64, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !225, file: !212, line: 426, baseType: !207, size: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !225, file: !212, line: 427, baseType: !207, size: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !225, file: !212, line: 428, baseType: !207, size: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !225, file: !212, line: 429, baseType: !207, size: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !212, line: 423, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 402, size: 304, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !233, file: !212, line: 403, baseType: !207, size: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !233, file: !212, line: 404, baseType: !207, size: 16, offset: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !233, file: !212, line: 405, baseType: !207, size: 16, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !233, file: !212, line: 406, baseType: !207, size: 16, offset: 48)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !233, file: !212, line: 407, baseType: !207, size: 16, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !233, file: !212, line: 408, baseType: !207, size: 16, offset: 80)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !233, file: !212, line: 409, baseType: !207, size: 16, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !233, file: !212, line: 410, baseType: !207, size: 16, offset: 112)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !233, file: !212, line: 411, baseType: !207, size: 16, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !233, file: !212, line: 412, baseType: !207, size: 16, offset: 144)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !233, file: !212, line: 413, baseType: !207, size: 16, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !233, file: !212, line: 414, baseType: !207, size: 16, offset: 176)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !233, file: !212, line: 415, baseType: !207, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !233, file: !212, line: 416, baseType: !207, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !233, file: !212, line: 418, baseType: !207, size: 16, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !233, file: !212, line: 419, baseType: !207, size: 16, offset: 240)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !233, file: !212, line: 420, baseType: !207, size: 16, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !233, file: !212, line: 421, baseType: !207, size: 16, offset: 272)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !233, file: !212, line: 422, baseType: !207, size: 16, offset: 288)
!254 = !{!255, !439, !175, !441, !444, !446}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "__global_locale", scope: !177, file: !212, line: 377, type: !257, isLocal: false, isDefinition: true)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !181, line: 330, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !181, line: 154, size: 26560, elements: !260)
!260 = !{!261, !268, !274, !275, !279, !281, !282, !286, !290, !292, !293, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !259, file: !181, line: 156, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !265, line: 38, baseType: !266)
!265 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !267, line: 44, baseType: !94)
!267 = !DIFile(filename: "./include/bits/types.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !259, file: !181, line: 157, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !265, line: 42, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !267, line: 43, baseType: !273)
!273 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !259, file: !181, line: 158, baseType: !269, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !259, file: !181, line: 162, baseType: !276, size: 6144, offset: 192)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 6144, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !259, file: !181, line: 163, baseType: !280, size: 6144, offset: 6336)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 6144, elements: !277)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !259, file: !181, line: 164, baseType: !280, size: 6144, offset: 12480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !259, file: !181, line: 168, baseType: !283, size: 112, offset: 18624)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 14)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !259, file: !181, line: 174, baseType: !287, size: 96, offset: 18736)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 96, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 6)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !259, file: !181, line: 175, baseType: !291, size: 48, offset: 18832)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !259, file: !181, line: 178, baseType: !96, size: 8, offset: 18880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !259, file: !181, line: 179, baseType: !96, size: 8, offset: 18888)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !259, file: !181, line: 180, baseType: !295, size: 80, offset: 18896)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 80, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 10)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !259, file: !181, line: 183, baseType: !203, size: 64, offset: 19008)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !259, file: !181, line: 184, baseType: !203, size: 64, offset: 19072)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !259, file: !181, line: 185, baseType: !203, size: 64, offset: 19136)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !259, file: !181, line: 186, baseType: !203, size: 64, offset: 19200)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !259, file: !181, line: 188, baseType: !203, size: 64, offset: 19264)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !259, file: !181, line: 189, baseType: !205, size: 64, offset: 19328)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !259, file: !181, line: 190, baseType: !203, size: 64, offset: 19392)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !259, file: !181, line: 191, baseType: !203, size: 64, offset: 19456)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !259, file: !181, line: 197, baseType: !205, size: 64, offset: 19520)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !259, file: !181, line: 199, baseType: !203, size: 64, offset: 19584)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !259, file: !181, line: 200, baseType: !203, size: 64, offset: 19648)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !259, file: !181, line: 202, baseType: !310, size: 64, offset: 19712)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !273)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !259, file: !181, line: 205, baseType: !314, size: 32, offset: 19776)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !259, file: !181, line: 206, baseType: !314, size: 32, offset: 19808)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !259, file: !181, line: 207, baseType: !45, size: 32, offset: 19840)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !259, file: !181, line: 208, baseType: !45, size: 32, offset: 19872)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !259, file: !181, line: 213, baseType: !29, size: 64, offset: 19904)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !259, file: !181, line: 214, baseType: !29, size: 64, offset: 19968)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !259, file: !181, line: 215, baseType: !29, size: 64, offset: 20032)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !259, file: !181, line: 216, baseType: !29, size: 64, offset: 20096)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !259, file: !181, line: 217, baseType: !29, size: 64, offset: 20160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !259, file: !181, line: 218, baseType: !29, size: 64, offset: 20224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !259, file: !181, line: 219, baseType: !29, size: 64, offset: 20288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !259, file: !181, line: 220, baseType: !29, size: 64, offset: 20352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !259, file: !181, line: 221, baseType: !29, size: 64, offset: 20416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !259, file: !181, line: 222, baseType: !29, size: 64, offset: 20480)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !259, file: !181, line: 223, baseType: !29, size: 64, offset: 20544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !259, file: !181, line: 226, baseType: !29, size: 64, offset: 20608)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !259, file: !181, line: 227, baseType: !29, size: 64, offset: 20672)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !259, file: !181, line: 228, baseType: !29, size: 64, offset: 20736)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !259, file: !181, line: 231, baseType: !29, size: 64, offset: 20800)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !259, file: !181, line: 232, baseType: !29, size: 64, offset: 20864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !259, file: !181, line: 233, baseType: !29, size: 64, offset: 20928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !259, file: !181, line: 234, baseType: !29, size: 64, offset: 20992)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !259, file: !181, line: 235, baseType: !29, size: 64, offset: 21056)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !259, file: !181, line: 236, baseType: !29, size: 64, offset: 21120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !259, file: !181, line: 237, baseType: !29, size: 64, offset: 21184)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !259, file: !181, line: 238, baseType: !29, size: 64, offset: 21248)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !259, file: !181, line: 239, baseType: !29, size: 64, offset: 21312)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !259, file: !181, line: 240, baseType: !29, size: 64, offset: 21376)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !259, file: !181, line: 241, baseType: !29, size: 64, offset: 21440)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !259, file: !181, line: 242, baseType: !29, size: 64, offset: 21504)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !259, file: !181, line: 243, baseType: !29, size: 64, offset: 21568)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !259, file: !181, line: 244, baseType: !29, size: 64, offset: 21632)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !259, file: !181, line: 245, baseType: !29, size: 64, offset: 21696)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !259, file: !181, line: 246, baseType: !29, size: 64, offset: 21760)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !259, file: !181, line: 247, baseType: !29, size: 64, offset: 21824)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !259, file: !181, line: 248, baseType: !29, size: 64, offset: 21888)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !259, file: !181, line: 249, baseType: !29, size: 64, offset: 21952)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !259, file: !181, line: 250, baseType: !29, size: 64, offset: 22016)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !259, file: !181, line: 251, baseType: !29, size: 64, offset: 22080)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !259, file: !181, line: 253, baseType: !29, size: 64, offset: 22144)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !259, file: !181, line: 256, baseType: !29, size: 64, offset: 22208)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !259, file: !181, line: 257, baseType: !29, size: 64, offset: 22272)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !259, file: !181, line: 258, baseType: !29, size: 64, offset: 22336)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !259, file: !181, line: 259, baseType: !29, size: 64, offset: 22400)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !259, file: !181, line: 260, baseType: !29, size: 64, offset: 22464)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !259, file: !181, line: 261, baseType: !29, size: 64, offset: 22528)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !259, file: !181, line: 262, baseType: !29, size: 64, offset: 22592)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !259, file: !181, line: 264, baseType: !29, size: 64, offset: 22656)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !259, file: !181, line: 265, baseType: !29, size: 64, offset: 22720)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !259, file: !181, line: 266, baseType: !29, size: 64, offset: 22784)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !259, file: !181, line: 267, baseType: !29, size: 64, offset: 22848)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !259, file: !181, line: 268, baseType: !29, size: 64, offset: 22912)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !259, file: !181, line: 269, baseType: !29, size: 64, offset: 22976)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !259, file: !181, line: 270, baseType: !29, size: 64, offset: 23040)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !259, file: !181, line: 272, baseType: !29, size: 64, offset: 23104)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !259, file: !181, line: 273, baseType: !29, size: 64, offset: 23168)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !259, file: !181, line: 274, baseType: !29, size: 64, offset: 23232)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !259, file: !181, line: 275, baseType: !29, size: 64, offset: 23296)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !259, file: !181, line: 276, baseType: !29, size: 64, offset: 23360)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !259, file: !181, line: 277, baseType: !29, size: 64, offset: 23424)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !259, file: !181, line: 278, baseType: !29, size: 64, offset: 23488)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !259, file: !181, line: 279, baseType: !29, size: 64, offset: 23552)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !259, file: !181, line: 280, baseType: !29, size: 64, offset: 23616)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !259, file: !181, line: 281, baseType: !29, size: 64, offset: 23680)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !259, file: !181, line: 282, baseType: !29, size: 64, offset: 23744)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !259, file: !181, line: 283, baseType: !29, size: 64, offset: 23808)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !259, file: !181, line: 285, baseType: !29, size: 64, offset: 23872)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !259, file: !181, line: 286, baseType: !29, size: 64, offset: 23936)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !259, file: !181, line: 287, baseType: !29, size: 64, offset: 24000)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !259, file: !181, line: 288, baseType: !29, size: 64, offset: 24064)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !259, file: !181, line: 289, baseType: !29, size: 64, offset: 24128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !259, file: !181, line: 290, baseType: !29, size: 64, offset: 24192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !259, file: !181, line: 291, baseType: !29, size: 64, offset: 24256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !259, file: !181, line: 292, baseType: !29, size: 64, offset: 24320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !259, file: !181, line: 293, baseType: !29, size: 64, offset: 24384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !259, file: !181, line: 294, baseType: !29, size: 64, offset: 24448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !259, file: !181, line: 295, baseType: !29, size: 64, offset: 24512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !259, file: !181, line: 296, baseType: !29, size: 64, offset: 24576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !259, file: !181, line: 298, baseType: !29, size: 64, offset: 24640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !259, file: !181, line: 299, baseType: !29, size: 64, offset: 24704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !259, file: !181, line: 301, baseType: !29, size: 64, offset: 24768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !259, file: !181, line: 302, baseType: !29, size: 64, offset: 24832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !259, file: !181, line: 303, baseType: !29, size: 64, offset: 24896)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !259, file: !181, line: 304, baseType: !29, size: 64, offset: 24960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !259, file: !181, line: 305, baseType: !29, size: 64, offset: 25024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !259, file: !181, line: 307, baseType: !29, size: 64, offset: 25088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !259, file: !181, line: 308, baseType: !29, size: 64, offset: 25152)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !259, file: !181, line: 309, baseType: !29, size: 64, offset: 25216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !259, file: !181, line: 310, baseType: !29, size: 64, offset: 25280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !259, file: !181, line: 311, baseType: !29, size: 64, offset: 25344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !259, file: !181, line: 316, baseType: !29, size: 64, offset: 25408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !259, file: !181, line: 317, baseType: !29, size: 64, offset: 25472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !259, file: !181, line: 318, baseType: !29, size: 64, offset: 25536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !259, file: !181, line: 319, baseType: !29, size: 64, offset: 25600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !259, file: !181, line: 322, baseType: !409, size: 896, offset: 25664)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !181, line: 149, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 111, size: 896, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !437, !438}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !410, file: !181, line: 112, baseType: !207, size: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !410, file: !181, line: 113, baseType: !207, size: 16, offset: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !410, file: !181, line: 114, baseType: !207, size: 16, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !410, file: !181, line: 115, baseType: !207, size: 16, offset: 48)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !410, file: !181, line: 116, baseType: !207, size: 16, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !410, file: !181, line: 117, baseType: !207, size: 16, offset: 80)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !410, file: !181, line: 118, baseType: !207, size: 16, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !410, file: !181, line: 119, baseType: !207, size: 16, offset: 112)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !410, file: !181, line: 120, baseType: !207, size: 16, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !410, file: !181, line: 121, baseType: !207, size: 16, offset: 144)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !410, file: !181, line: 122, baseType: !207, size: 16, offset: 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !410, file: !181, line: 123, baseType: !207, size: 16, offset: 176)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !410, file: !181, line: 124, baseType: !207, size: 16, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !410, file: !181, line: 125, baseType: !207, size: 16, offset: 208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !410, file: !181, line: 127, baseType: !207, size: 16, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !410, file: !181, line: 128, baseType: !207, size: 16, offset: 240)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !410, file: !181, line: 130, baseType: !205, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !410, file: !181, line: 131, baseType: !205, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !410, file: !181, line: 132, baseType: !205, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !410, file: !181, line: 135, baseType: !205, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !410, file: !181, line: 138, baseType: !205, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !410, file: !181, line: 141, baseType: !205, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !410, file: !181, line: 142, baseType: !205, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !410, file: !181, line: 145, baseType: !436, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !410, file: !181, line: 146, baseType: !436, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !410, file: !181, line: 148, baseType: !207, size: 16, offset: 832)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !177, file: !212, line: 380, type: !257, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "utf8", scope: !177, file: !212, line: 387, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !288)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "ascii", scope: !177, file: !212, line: 388, type: !443, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "__code2flag", scope: !177, file: !212, line: 854, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 256, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 16)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !181, line: 324, baseType: !259)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !454, file: !455, line: 131, type: !499, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !456, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!456 = !{!457, !489, !491, !493, !495, !497, !452}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "stdin", scope: !454, file: !455, line: 154, type: !459, isLocal: false, isDefinition: true)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !461, line: 46, baseType: !462)
!461 = !DIFile(filename: "./include/stdio.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !463, line: 233, size: 704, elements: !464)
!463 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!464 = !{!465, !466, !470, !471, !472, !473, !474, !475, !476, !477, !479, !481, !488}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !462, file: !463, line: 234, baseType: !94, size: 16)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !462, file: !463, line: 237, baseType: !467, size: 16, offset: 16)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 2)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !462, file: !463, line: 244, baseType: !45, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !462, file: !463, line: 246, baseType: !209, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !462, file: !463, line: 247, baseType: !209, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !462, file: !463, line: 248, baseType: !209, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !462, file: !463, line: 249, baseType: !209, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !462, file: !463, line: 252, baseType: !209, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !462, file: !463, line: 255, baseType: !209, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !462, file: !463, line: 261, baseType: !478, size: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !462, file: !463, line: 268, baseType: !480, size: 64, offset: 512)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !468)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !462, file: !463, line: 271, baseType: !482, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !483, line: 85, baseType: !484)
!483 = !DIFile(filename: "./include/wchar.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !483, line: 81, size: 64, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !484, file: !483, line: 83, baseType: !314, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !484, file: !483, line: 84, baseType: !314, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !462, file: !463, line: 274, baseType: !6, size: 64, offset: 640)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "stdout", scope: !454, file: !455, line: 155, type: !459, isLocal: false, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "stderr", scope: !454, file: !455, line: 156, type: !459, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "__stdin", scope: !454, file: !455, line: 159, type: !459, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__stdout", scope: !454, file: !455, line: 162, type: !459, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !454, file: !455, line: 180, type: !459, isLocal: false, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 2112, elements: !137)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !502, file: !503, line: 49, type: !45, isLocal: true, isDefinition: true)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !504, globals: !518, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "libc/stdlib/abort.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!504 = !{!505, !6, !514}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !507, line: 50, baseType: !508)
!507 = !DIFile(filename: "./include/signal.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !509, line: 31, baseType: !510)
!509 = !DIFile(filename: "./include/bits/sigset.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 28, size: 1024, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !510, file: !509, line: 30, baseType: !513, size: 1024)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !449)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !507, line: 75, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !45}
!518 = !{!500}
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !521, file: !524, line: 309, type: !515, isLocal: false, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !523, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!523 = !{!519}
!524 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "mSmmMemLibInternalMaximumSupportAddress", scope: !527, file: !884, line: 43, type: !648, isLocal: false, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !529, retainedTypes: !626, globals: !881, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "stase_driver.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!529 = !{!530, !541, !561, !567, !574, !579, !582, !587, !594, !599, !607, !613, !620}
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 21, baseType: !62, size: 32, elements: !532)
!531 = !DIFile(filename: "edk2/MdePkg/Include/Pi/PiDxeCis.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540}
!533 = !DIEnumerator(name: "EfiGcdMemoryTypeNonExistent", value: 0)
!534 = !DIEnumerator(name: "EfiGcdMemoryTypeReserved", value: 1)
!535 = !DIEnumerator(name: "EfiGcdMemoryTypeSystemMemory", value: 2)
!536 = !DIEnumerator(name: "EfiGcdMemoryTypeMemoryMappedIo", value: 3)
!537 = !DIEnumerator(name: "EfiGcdMemoryTypePersistent", value: 4)
!538 = !DIEnumerator(name: "EfiGcdMemoryTypePersistentMemory", value: 4)
!539 = !DIEnumerator(name: "EfiGcdMemoryTypeMoreReliable", value: 5)
!540 = !DIEnumerator(name: "EfiGcdMemoryTypeMaximum", value: 7)
!541 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !542, line: 38, baseType: !62, size: 32, elements: !543)
!542 = !DIFile(filename: "edk2/MdePkg/Include/Uefi/UefiMultiPhase.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!544 = !DIEnumerator(name: "EfiReservedMemoryType", value: 0)
!545 = !DIEnumerator(name: "EfiLoaderCode", value: 1)
!546 = !DIEnumerator(name: "EfiLoaderData", value: 2)
!547 = !DIEnumerator(name: "EfiBootServicesCode", value: 3)
!548 = !DIEnumerator(name: "EfiBootServicesData", value: 4)
!549 = !DIEnumerator(name: "EfiRuntimeServicesCode", value: 5)
!550 = !DIEnumerator(name: "EfiRuntimeServicesData", value: 6)
!551 = !DIEnumerator(name: "EfiConventionalMemory", value: 7)
!552 = !DIEnumerator(name: "EfiUnusableMemory", value: 8)
!553 = !DIEnumerator(name: "EfiACPIReclaimMemory", value: 9)
!554 = !DIEnumerator(name: "EfiACPIMemoryNVS", value: 10)
!555 = !DIEnumerator(name: "EfiMemoryMappedIO", value: 11)
!556 = !DIEnumerator(name: "EfiMemoryMappedIOPortSpace", value: 12)
!557 = !DIEnumerator(name: "EfiPalCode", value: 13)
!558 = !DIEnumerator(name: "EfiPersistentMemory", value: 14)
!559 = !DIEnumerator(name: "EfiUnacceptedMemoryType", value: 15)
!560 = !DIEnumerator(name: "EfiMaxMemoryType", value: 16)
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !542, line: 117, baseType: !62, size: 32, elements: !562)
!562 = !{!563, !564, !565, !566}
!563 = !DIEnumerator(name: "EfiResetCold", value: 0)
!564 = !DIEnumerator(name: "EfiResetWarm", value: 1)
!565 = !DIEnumerator(name: "EfiResetShutdown", value: 2)
!566 = !DIEnumerator(name: "EfiResetPlatformSpecific", value: 3)
!567 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 29, baseType: !62, size: 32, elements: !569)
!568 = !DIFile(filename: "edk2/MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!569 = !{!570, !571, !572, !573}
!570 = !DIEnumerator(name: "AllocateAnyPages", value: 0)
!571 = !DIEnumerator(name: "AllocateMaxAddress", value: 1)
!572 = !DIEnumerator(name: "AllocateAddress", value: 2)
!573 = !DIEnumerator(name: "MaxAllocateType", value: 3)
!574 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 506, baseType: !62, size: 32, elements: !575)
!575 = !{!576, !577, !578}
!576 = !DIEnumerator(name: "TimerCancel", value: 0)
!577 = !DIEnumerator(name: "TimerPeriodic", value: 1)
!578 = !DIEnumerator(name: "TimerRelative", value: 2)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 1144, baseType: !62, size: 32, elements: !580)
!580 = !{!581}
!581 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!582 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 1460, baseType: !62, size: 32, elements: !583)
!583 = !{!584, !585, !586}
!584 = !DIEnumerator(name: "AllHandles", value: 0)
!585 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!586 = !DIEnumerator(name: "ByProtocol", value: 2)
!587 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !588, line: 24, baseType: !62, size: 32, elements: !589)
!588 = !DIFile(filename: "edk2/MdePkg/Include/Protocol/MmCpuIo.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!589 = !{!590, !591, !592, !593}
!590 = !DIEnumerator(name: "MM_IO_UINT8", value: 0)
!591 = !DIEnumerator(name: "MM_IO_UINT16", value: 1)
!592 = !DIEnumerator(name: "MM_IO_UINT32", value: 2)
!593 = !DIEnumerator(name: "MM_IO_UINT64", value: 3)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !595, line: 44, baseType: !62, size: 32, elements: !596)
!595 = !DIFile(filename: "./edk2/MdeModulePkg/Universal/Variable/RuntimeDxe/TcgMorLockSmm.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!596 = !{!597, !598}
!597 = !DIEnumerator(name: "MorLockStateUnlocked", value: 0)
!598 = !DIEnumerator(name: "MorLockStateLocked", value: 1)
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 95, baseType: !62, size: 32, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606}
!601 = !DIEnumerator(name: "EfiGcdAllocateAnySearchBottomUp", value: 0)
!602 = !DIEnumerator(name: "EfiGcdAllocateMaxAddressSearchBottomUp", value: 1)
!603 = !DIEnumerator(name: "EfiGcdAllocateAddress", value: 2)
!604 = !DIEnumerator(name: "EfiGcdAllocateAnySearchTopDown", value: 3)
!605 = !DIEnumerator(name: "EfiGcdAllocateMaxAddressSearchTopDown", value: 4)
!606 = !DIEnumerator(name: "EfiGcdMaxAllocateType", value: 5)
!607 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 73, baseType: !62, size: 32, elements: !608)
!608 = !{!609, !610, !611, !612}
!609 = !DIEnumerator(name: "EfiGcdIoTypeNonExistent", value: 0)
!610 = !DIEnumerator(name: "EfiGcdIoTypeReserved", value: 1)
!611 = !DIEnumerator(name: "EfiGcdIoTypeIo", value: 2)
!612 = !DIEnumerator(name: "EfiGcdIoTypeMaximum", value: 3)
!613 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !614, line: 14, baseType: !62, size: 32, elements: !615)
!614 = !DIFile(filename: "edk2/MdeModulePkg/Include/Library/VarCheckLib.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!615 = !{!616, !617, !618, !619}
!616 = !DIEnumerator(name: "VarCheckRequestReserved0", value: 0)
!617 = !DIEnumerator(name: "VarCheckRequestReserved1", value: 1)
!618 = !DIEnumerator(name: "VarCheckFromTrusted", value: 2)
!619 = !DIEnumerator(name: "VarCheckFromUntrusted", value: 3)
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !621, line: 49, baseType: !62, size: 32, elements: !622)
!621 = !DIFile(filename: "edk2/MdePkg/Include/Library/UefiLib.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!622 = !{!623, !624, !625}
!623 = !DIEnumerator(name: "EfiLockUninitialized", value: 0)
!624 = !DIEnumerator(name: "EfiLockReleased", value: 1)
!625 = !DIEnumerator(name: "EfiLockAcquired", value: 2)
!626 = !{!6, !627, !643, !647, !648, !651, !652, !662, !663, !665, !667, !668, !669, !671, !673, !674, !676, !700, !650, !716, !717, !724, !733, !741, !641, !10, !746, !748, !756, !766, !773, !781, !786, !800, !802, !819, !828, !840, !848, !856, !863, !865, !864, !866}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HOB_CPU", file: !629, line: 462, baseType: !630)
!629 = !DIFile(filename: "edk2/MdePkg/Include/Pi/PiHob.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !629, line: 445, size: 128, elements: !631)
!631 = !{!632, !642, !644, !645}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !630, file: !629, line: 449, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HOB_GENERIC_HEADER", file: !629, line: 49, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !629, line: 36, size: 64, elements: !635)
!635 = !{!636, !639, !640}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "HobType", scope: !634, file: !629, line: 40, baseType: !637, size: 16)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !638, line: 105, baseType: !94)
!638 = !DIFile(filename: "edk2/MdePkg/Include/Arm/ProcessorBind.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!639 = !DIDerivedType(tag: DW_TAG_member, name: "HobLength", scope: !634, file: !629, line: 44, baseType: !637, size: 16, offset: 16)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !634, file: !629, line: 48, baseType: !641, size: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !638, line: 103, baseType: !62)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfMemorySpace", scope: !630, file: !629, line: 453, baseType: !643, size: 8, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !638, line: 109, baseType: !96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfIoSpace", scope: !630, file: !629, line: 457, baseType: !643, size: 8, offset: 72)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !630, file: !629, line: 461, baseType: !646, size: 48, offset: 80)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 48, elements: !288)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !638, line: 108, baseType: !96)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !649, line: 50, baseType: !650)
!649 = !DIFile(filename: "edk2/MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !638, line: 101, baseType: !25)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !638, line: 118, baseType: !641)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !568, line: 160, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 128, size: 320, elements: !655)
!655 = !{!656, !657, !658, !660, !661}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !654, file: !568, line: 134, baseType: !641, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !654, file: !568, line: 140, baseType: !648, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !654, file: !568, line: 146, baseType: !659, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !649, line: 55, baseType: !650)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !654, file: !568, line: 153, baseType: !650, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !654, file: !568, line: 159, baseType: !650, size: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !664, line: 1026, baseType: !651)
!664 = !DIFile(filename: "edk2/MdePkg/Include/Base.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !638, line: 124, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !638, line: 104, baseType: !45)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !641)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_COMMUNICATE_HEADER", file: !678, line: 17, baseType: !679)
!678 = !DIFile(filename: "edk2/MdePkg/Include/Protocol/SmmCommunication.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_COMMUNICATE_HEADER", file: !680, line: 34, baseType: !681)
!680 = !DIFile(filename: "edk2/MdePkg/Include/Protocol/MmCommunication.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !680, line: 21, size: 168, elements: !682)
!682 = !{!683, !695, !696}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderGuid", scope: !681, file: !680, line: 25, baseType: !684, size: 128)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !649, line: 25, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !664, line: 218, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !664, line: 213, size: 128, elements: !687)
!687 = !{!688, !689, !690, !691}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !686, file: !664, line: 214, baseType: !641, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !686, file: !664, line: 215, baseType: !637, size: 16, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !686, file: !664, line: 216, baseType: !637, size: 16, offset: 48)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !686, file: !664, line: 217, baseType: !692, size: 64, offset: 64)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 64, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 8)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "MessageLength", scope: !681, file: !680, line: 29, baseType: !651, size: 32, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !681, file: !680, line: 33, baseType: !697, size: 8, offset: 160)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 8, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 1)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_SAVE", file: !702, line: 37, baseType: !703)
!702 = !DIFile(filename: "edk2/MdeModulePkg/Include/Guid/SmmLockBox.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 32, size: 384, elements: !704)
!704 = !{!705, !712, !713, !715}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !703, file: !702, line: 33, baseType: !706, size: 128)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_HEADER", file: !702, line: 30, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 26, size: 128, elements: !708)
!708 = !{!709, !710, !711}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Command", scope: !707, file: !702, line: 27, baseType: !641, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !707, file: !702, line: 28, baseType: !641, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnStatus", scope: !707, file: !702, line: 29, baseType: !650, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !703, file: !702, line: 34, baseType: !685, size: 128, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !703, file: !702, line: 35, baseType: !714, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_ADDRESS", file: !664, line: 237, baseType: !650)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !703, file: !702, line: 36, baseType: !650, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !649, line: 29, baseType: !663)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_SET_ATTRIBUTES", file: !702, line: 58, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 54, size: 320, elements: !720)
!720 = !{!721, !722, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !719, file: !702, line: 55, baseType: !706, size: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !719, file: !702, line: 56, baseType: !685, size: 128, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !719, file: !702, line: 57, baseType: !650, size: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_UPDATE", file: !702, line: 45, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 39, size: 448, elements: !727)
!727 = !{!728, !729, !730, !731, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !726, file: !702, line: 40, baseType: !706, size: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !726, file: !702, line: 41, baseType: !685, size: 128, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !726, file: !702, line: 42, baseType: !650, size: 64, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !726, file: !702, line: 43, baseType: !714, size: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !726, file: !702, line: 44, baseType: !650, size: 64, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_RESTORE", file: !702, line: 52, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 47, size: 384, elements: !736)
!736 = !{!737, !738, !739, !740}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !735, file: !702, line: 48, baseType: !706, size: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !735, file: !702, line: 49, baseType: !685, size: 128, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !735, file: !702, line: 50, baseType: !714, size: 64, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !735, file: !702, line: 51, baseType: !650, size: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_RESTORE_ALL_IN_PLACE", file: !702, line: 62, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 60, size: 128, elements: !744)
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !743, file: !702, line: 61, baseType: !706, size: 128)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !638, line: 106, baseType: !94)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_HEADER", file: !750, line: 29, baseType: !751)
!750 = !DIFile(filename: "edk2/MdeModulePkg/Include/Guid/SmmVariableCommon.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 25, size: 96, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !751, file: !750, line: 26, baseType: !651, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnStatus", scope: !751, file: !750, line: 27, baseType: !716, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !751, file: !750, line: 28, baseType: !697, size: 8, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_ACCESS_VARIABLE", file: !750, line: 100, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 94, size: 256, elements: !759)
!759 = !{!760, !761, !762, !763, !764}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !758, file: !750, line: 95, baseType: !684, size: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "DataSize", scope: !758, file: !750, line: 96, baseType: !651, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "NameSize", scope: !758, file: !750, line: 97, baseType: !651, size: 32, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !758, file: !750, line: 98, baseType: !641, size: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !758, file: !750, line: 99, baseType: !765, size: 16, offset: 224)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 16, elements: !698)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_GET_NEXT_VARIABLE_NAME", file: !750, line: 109, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 105, size: 192, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !768, file: !750, line: 106, baseType: !684, size: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "NameSize", scope: !768, file: !750, line: 107, baseType: !651, size: 32, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !768, file: !750, line: 108, baseType: !765, size: 16, offset: 160)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_QUERY_VARIABLE_INFO", file: !750, line: 119, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 114, size: 256, elements: !776)
!776 = !{!777, !778, !779, !780}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumVariableStorageSize", scope: !775, file: !750, line: 115, baseType: !650, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RemainingVariableStorageSize", scope: !775, file: !750, line: 116, baseType: !650, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumVariableSize", scope: !775, file: !750, line: 117, baseType: !650, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !775, file: !750, line: 118, baseType: !641, size: 32, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_GET_PAYLOAD_SIZE", file: !750, line: 132, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 130, size: 32, elements: !784)
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "VariablePayloadSize", scope: !783, file: !750, line: 131, baseType: !651, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "VARIABLE_INFO_ENTRY", file: !788, line: 202, baseType: !789)
!788 = !DIFile(filename: "edk2/MdeModulePkg/Include/Guid/VariableFormat.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VARIABLE_INFO_ENTRY", file: !788, line: 209, size: 448, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !789, file: !788, line: 210, baseType: !786, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !789, file: !788, line: 211, baseType: !684, size: 128, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !789, file: !788, line: 212, baseType: !746, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !789, file: !788, line: 213, baseType: !641, size: 32, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ReadCount", scope: !789, file: !788, line: 214, baseType: !641, size: 32, offset: 288)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "WriteCount", scope: !789, file: !788, line: 215, baseType: !641, size: 32, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteCount", scope: !789, file: !788, line: 216, baseType: !641, size: 32, offset: 352)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "CacheCount", scope: !789, file: !788, line: 217, baseType: !641, size: 32, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Volatile", scope: !789, file: !788, line: 218, baseType: !647, size: 8, offset: 416)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_LOCK_VARIABLE", file: !750, line: 121, baseType: !767)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_VAR_CHECK_VARIABLE_PROPERTY", file: !750, line: 128, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 123, size: 320, elements: !805)
!805 = !{!806, !807, !808, !818}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !804, file: !750, line: 124, baseType: !684, size: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "NameSize", scope: !804, file: !750, line: 125, baseType: !651, size: 32, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "VariableProperty", scope: !804, file: !750, line: 126, baseType: !809, size: 128, offset: 160)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "VAR_CHECK_VARIABLE_PROPERTY", file: !810, line: 58, baseType: !811)
!810 = !DIFile(filename: "edk2/MdeModulePkg/Include/Protocol/VarCheck.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !810, line: 52, size: 128, elements: !812)
!812 = !{!813, !814, !815, !816, !817}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !811, file: !810, line: 53, baseType: !637, size: 16)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Property", scope: !811, file: !810, line: 54, baseType: !637, size: 16, offset: 16)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !811, file: !810, line: 55, baseType: !641, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "MinSize", scope: !811, file: !810, line: 56, baseType: !651, size: 32, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSize", scope: !811, file: !810, line: 57, baseType: !651, size: 32, offset: 96)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !804, file: !750, line: 127, baseType: !765, size: 16, offset: 288)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_RUNTIME_VARIABLE_CACHE_CONTEXT", file: !750, line: 141, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 134, size: 384, elements: !822)
!822 = !{!823, !825, !826, !827, !838, !839}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ReadLock", scope: !821, file: !750, line: 135, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "PendingUpdate", scope: !821, file: !750, line: 136, baseType: !824, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "HobFlushComplete", scope: !821, file: !750, line: 137, baseType: !824, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeHobCache", scope: !821, file: !750, line: 138, baseType: !828, size: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "VARIABLE_STORE_HEADER", file: !788, line: 87, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 67, size: 224, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !830, file: !788, line: 71, baseType: !684, size: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !830, file: !788, line: 76, baseType: !641, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "Format", scope: !830, file: !788, line: 80, baseType: !643, size: 8, offset: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !830, file: !788, line: 84, baseType: !643, size: 8, offset: 168)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !830, file: !788, line: 85, baseType: !637, size: 16, offset: 176)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !830, file: !788, line: 86, baseType: !641, size: 32, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeNvCache", scope: !821, file: !750, line: 139, baseType: !828, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeVolatileCache", scope: !821, file: !750, line: 140, baseType: !828, size: 64, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_GET_RUNTIME_CACHE_INFO", file: !750, line: 148, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 143, size: 128, elements: !843)
!843 = !{!844, !845, !846, !847}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "TotalHobStorageSize", scope: !842, file: !750, line: 144, baseType: !651, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "TotalNvStorageSize", scope: !842, file: !750, line: 145, baseType: !651, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "TotalVolatileStorageSize", scope: !842, file: !750, line: 146, baseType: !651, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "AuthenticatedVariableUsage", scope: !842, file: !750, line: 147, baseType: !647, size: 8, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "VARIABLE_LOCK_ON_VAR_STATE_POLICY", file: !850, line: 62, baseType: !851)
!850 = !DIFile(filename: "edk2/MdeModulePkg/Include/Protocol/VariablePolicy.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !850, line: 57, size: 144, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Namespace", scope: !851, file: !850, line: 58, baseType: !684, size: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Value", scope: !851, file: !850, line: 59, baseType: !643, size: 8, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Padding", scope: !851, file: !850, line: 60, baseType: !643, size: 8, offset: 136)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "VAR_CHECK_VARIABLE_ENTRY", file: !858, line: 38, baseType: !859)
!858 = !DIFile(filename: "./harness/../edk2/MdeModulePkg/Library/VarCheckLib/VarCheckLib.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !858, line: 34, size: 256, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !859, file: !858, line: 35, baseType: !684, size: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "VariableProperty", scope: !859, file: !858, line: 36, baseType: !809, size: 128, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "VARIABLE_POLICY_ENTRY", file: !850, line: 45, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !850, line: 32, size: 352, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !868, file: !850, line: 33, baseType: !641, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !868, file: !850, line: 34, baseType: !637, size: 16, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "OffsetToName", scope: !868, file: !850, line: 35, baseType: !637, size: 16, offset: 48)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Namespace", scope: !868, file: !850, line: 36, baseType: !684, size: 128, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "MinSize", scope: !868, file: !850, line: 37, baseType: !641, size: 32, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSize", scope: !868, file: !850, line: 38, baseType: !641, size: 32, offset: 224)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "AttributesMustHave", scope: !868, file: !850, line: 39, baseType: !641, size: 32, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "AttributesCantHave", scope: !868, file: !850, line: 40, baseType: !641, size: 32, offset: 288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "LockPolicyType", scope: !868, file: !850, line: 41, baseType: !643, size: 8, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Padding", scope: !868, file: !850, line: 42, baseType: !880, size: 24, offset: 328)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 24, elements: !137)
!881 = !{!525, !882, !898, !900, !911, !913, !916, !931, !933, !942, !944, !946, !948, !950, !953, !1099, !1144, !1353, !1449, !1560, !1653, !1656, !1658, !1668, !1688, !1691, !1693, !1695, !1697, !1699, !1703, !1705, !1707, !1709, !1711, !1713, !1716, !1718, !1720, !1730, !1733, !1737, !1739, !1741, !1767, !1769, !1780, !1782, !1784, !1786, !1788, !1790, !1792, !1795, !1797, !1799, !1804, !1806, !1808, !1810, !1812, !1814, !1816, !1818, !1820, !1822, !1824, !1826, !1828, !1830, !1832, !1834, !1836, !1838, !1840, !1842, !1844, !1846, !1848, !1850, !1852, !1854, !1856, !1858, !1860, !1862, !1864, !1866, !1868, !1870, !1872, !1874, !1876, !1878, !1880, !1882, !1884, !1886, !1888, !1890, !1892, !1894, !1896, !1898, !1900, !1902, !1904, !1906, !1908, !1910, !1930, !1938, !1940, !1942, !1952, !1954, !2058, !2060, !2062, !2064, !2066}
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "mSmmMemLibGcdMemSpace", scope: !527, file: !884, line: 49, type: !885, isLocal: false, isDefinition: true)
!884 = !DIFile(filename: "./edk2/MdePkg/Library/SmmMemLib/SmmMemLib.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GCD_MEMORY_SPACE_DESCRIPTOR", file: !531, line: 173, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 127, size: 448, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !895, !897}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "BaseAddress", scope: !887, file: !531, line: 133, baseType: !648, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !887, file: !531, line: 138, baseType: !650, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "Capabilities", scope: !887, file: !531, line: 145, baseType: !650, size: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !887, file: !531, line: 150, baseType: !650, size: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "GcdMemoryType", scope: !887, file: !531, line: 155, baseType: !894, size: 32, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GCD_MEMORY_TYPE", file: !531, line: 68, baseType: !530)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ImageHandle", scope: !887, file: !531, line: 163, baseType: !896, size: 64, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !649, line: 33, baseType: !6)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceHandle", scope: !887, file: !531, line: 172, baseType: !896, size: 64, offset: 384)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "mSmmMemLibGcdMemNumberOfDesc", scope: !527, file: !884, line: 50, type: !651, isLocal: false, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "mSmmMemLibMemoryAttributesTable", scope: !527, file: !884, line: 52, type: !902, isLocal: false, isDefinition: true)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_ATTRIBUTES_TABLE", file: !904, line: 22, baseType: !905)
!904 = !DIFile(filename: "edk2/MdePkg/Include/Guid/MemoryAttributesTable.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !904, line: 16, size: 128, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !905, file: !904, line: 17, baseType: !641, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfEntries", scope: !905, file: !904, line: 18, baseType: !641, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "DescriptorSize", scope: !905, file: !904, line: 19, baseType: !641, size: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !905, file: !904, line: 20, baseType: !641, size: 32, offset: 96)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "mSmmMemLibSmmReadyToLock", scope: !527, file: !884, line: 57, type: !647, isLocal: false, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "mMmMemLibInternalMaximumSupportAddress", scope: !527, file: !915, line: 28, type: !648, isLocal: false, isDefinition: true)
!915 = !DIFile(filename: "./edk2/StandaloneMmPkg/Library/StandaloneMmMemLib/StandaloneMmMemLib.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "mLockBoxSmmCommProtocol", scope: !527, file: !918, line: 23, type: !919, isLocal: false, isDefinition: true)
!918 = !DIFile(filename: "./edk2/MdeModulePkg/Library/SmmLockBoxLib/SmmLockBoxDxeLib.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_COMMUNICATION_PROTOCOL", file: !678, line: 21, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_COMMUNICATION_PROTOCOL", file: !680, line: 43, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MM_COMMUNICATION_PROTOCOL", file: !680, line: 80, size: 64, elements: !923)
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "Communicate", scope: !922, file: !680, line: 81, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_COMMUNICATE", file: !680, line: 70, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!716, !929, !6, !864}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "mLockBoxSmmCommBuffer", scope: !527, file: !918, line: 24, type: !662, isLocal: false, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "mMorVariableType", scope: !527, file: !595, line: 30, type: !935, isLocal: false, isDefinition: true)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 256, elements: !468)
