; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__uclibc_locale_struct.193 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.192 }
%struct.__collate_t.192 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.560 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.560*, [2 x i32], %struct.__mbstate_t.559, i8* }
%struct.__mbstate_t.559 = type { i32, i32 }
%struct.EFI_GCD_MEMORY_SPACE_DESCRIPTOR = type { i64, i64, i64, i64, i32, i8*, i8* }
%struct.EFI_MEMORY_ATTRIBUTES_TABLE = type { i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 299, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 298, type: !55, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!54 = !DIFile(filename: "klee/runtime/POSIX/fd.c", directory: "/home/mdshafiuzzaman/Research/KLEE")
!55 = !DISubroutineType(types: !56)
!56 = !{!45, !45}
!57 = distinct !DICompileUnit(language: DW_LANG_C89, file: !58, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !80, globals: !139, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "/home/mdshafiuzzaman/Research/KLEE/klee/runtime/POSIX/fd.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee_build/runtime/POSIX")
!59 = !{!60, !68}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 58, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "klee/runtime/POSIX/fd.h", directory: "/home/mdshafiuzzaman/Research/KLEE")
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, baseType: !62, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !6, !82, !10, !86, !7, !101, !45, !8}
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 92, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 149, baseType: !10)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 26, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "")
!104 = !{!105, !107, !109, !111, !113, !115, !117, !118, !119, !121, !123, !125, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 31, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 36, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 44, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 45, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !62)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 47, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 48, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !62)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 50, baseType: !45, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 52, baseType: !106, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 57, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !81)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 61, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 175, baseType: !81)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 63, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 180, baseType: !81)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 74, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 16, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 197, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 75, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 76, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 89, baseType: !136, size: 192, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !{!51, !140, !147, !154, !160, !165, !170}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "n_calls", scope: !142, file: !54, line: 331, type: !45, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 330, type: !143, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !45, !6, !23}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 108, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 194, baseType: !81)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "n_calls", scope: !149, file: !54, line: 397, type: !45, isLocal: true, isDefinition: true)
!149 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 396, type: !150, scopeLine: 396, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!150 = !DISubroutineType(types: !151)
!151 = !{!145, !45, !152, !23}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "n_calls", scope: !156, file: !54, line: 633, type: !45, isLocal: true, isDefinition: true)
!156 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 632, type: !157, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!157 = !DISubroutineType(types: !158)
!158 = !{!45, !29, !159}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 69, baseType: !112)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "n_calls", scope: !162, file: !54, line: 652, type: !45, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 651, type: !163, scopeLine: 651, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!163 = !DISubroutineType(types: !164)
!164 = !{!45, !45, !159}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "n_calls", scope: !167, file: !54, line: 738, type: !45, isLocal: true, isDefinition: true)
!167 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 737, type: !168, scopeLine: 737, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!168 = !DISubroutineType(types: !169)
!169 = !{!45, !45, !82}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "n_calls", scope: !172, file: !54, line: 1332, type: !45, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1331, type: !173, scopeLine: 1331, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!173 = !DISubroutineType(types: !174)
!174 = !{!7, !7, !23}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !177, file: !212, line: 375, type: !451, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !179, retainedTypes: !201, globals: !254, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!179 = !{!180, !186}
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 90, baseType: !62, size: 32, elements: !182)
!181 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!182 = !{!183, !184, !185}
!183 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!184 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!185 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !187, line: 48, baseType: !62, size: 32, elements: !188)
!187 = !DIFile(filename: "./include/ctype.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200}
!189 = !DIEnumerator(name: "_ISupper", value: 256)
!190 = !DIEnumerator(name: "_ISlower", value: 512)
!191 = !DIEnumerator(name: "_ISalpha", value: 1024)
!192 = !DIEnumerator(name: "_ISdigit", value: 2048)
!193 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!194 = !DIEnumerator(name: "_ISspace", value: 8192)
!195 = !DIEnumerator(name: "_ISprint", value: 16384)
!196 = !DIEnumerator(name: "_ISgraph", value: 32768)
!197 = !DIEnumerator(name: "_ISblank", value: 1)
!198 = !DIEnumerator(name: "_IScntrl", value: 2)
!199 = !DIEnumerator(name: "_ISpunct", value: 4)
!200 = !DIEnumerator(name: "_ISalnum", value: 8)
!201 = !{!45, !202, !7, !203, !205, !208, !96, !209, !210, !223, !231, !10}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !94)
!208 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !212, line: 400, baseType: !213)
!212 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 390, size: 128, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !213, file: !212, line: 391, baseType: !207, size: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !213, file: !212, line: 392, baseType: !207, size: 16, offset: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !213, file: !212, line: 393, baseType: !207, size: 16, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !213, file: !212, line: 394, baseType: !207, size: 16, offset: 48)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !213, file: !212, line: 396, baseType: !207, size: 16, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !213, file: !212, line: 397, baseType: !207, size: 16, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !213, file: !212, line: 398, baseType: !207, size: 16, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !213, file: !212, line: 399, baseType: !207, size: 16, offset: 112)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !212, line: 430, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 425, size: 64, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !225, file: !212, line: 426, baseType: !207, size: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !225, file: !212, line: 427, baseType: !207, size: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !225, file: !212, line: 428, baseType: !207, size: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !225, file: !212, line: 429, baseType: !207, size: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !212, line: 423, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 402, size: 304, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !233, file: !212, line: 403, baseType: !207, size: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !233, file: !212, line: 404, baseType: !207, size: 16, offset: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !233, file: !212, line: 405, baseType: !207, size: 16, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !233, file: !212, line: 406, baseType: !207, size: 16, offset: 48)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !233, file: !212, line: 407, baseType: !207, size: 16, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !233, file: !212, line: 408, baseType: !207, size: 16, offset: 80)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !233, file: !212, line: 409, baseType: !207, size: 16, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !233, file: !212, line: 410, baseType: !207, size: 16, offset: 112)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !233, file: !212, line: 411, baseType: !207, size: 16, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !233, file: !212, line: 412, baseType: !207, size: 16, offset: 144)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !233, file: !212, line: 413, baseType: !207, size: 16, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !233, file: !212, line: 414, baseType: !207, size: 16, offset: 176)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !233, file: !212, line: 415, baseType: !207, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !233, file: !212, line: 416, baseType: !207, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !233, file: !212, line: 418, baseType: !207, size: 16, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !233, file: !212, line: 419, baseType: !207, size: 16, offset: 240)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !233, file: !212, line: 420, baseType: !207, size: 16, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !233, file: !212, line: 421, baseType: !207, size: 16, offset: 272)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !233, file: !212, line: 422, baseType: !207, size: 16, offset: 288)
!254 = !{!255, !439, !175, !441, !444, !446}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "__global_locale", scope: !177, file: !212, line: 377, type: !257, isLocal: false, isDefinition: true)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !181, line: 330, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !181, line: 154, size: 26560, elements: !260)
!260 = !{!261, !268, !274, !275, !279, !281, !282, !286, !290, !292, !293, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !259, file: !181, line: 156, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !265, line: 38, baseType: !266)
!265 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !267, line: 44, baseType: !94)
!267 = !DIFile(filename: "./include/bits/types.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !259, file: !181, line: 157, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !265, line: 42, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !267, line: 43, baseType: !273)
!273 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !259, file: !181, line: 158, baseType: !269, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !259, file: !181, line: 162, baseType: !276, size: 6144, offset: 192)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 6144, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !259, file: !181, line: 163, baseType: !280, size: 6144, offset: 6336)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 6144, elements: !277)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !259, file: !181, line: 164, baseType: !280, size: 6144, offset: 12480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !259, file: !181, line: 168, baseType: !283, size: 112, offset: 18624)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 14)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !259, file: !181, line: 174, baseType: !287, size: 96, offset: 18736)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 96, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 6)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !259, file: !181, line: 175, baseType: !291, size: 48, offset: 18832)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !259, file: !181, line: 178, baseType: !96, size: 8, offset: 18880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !259, file: !181, line: 179, baseType: !96, size: 8, offset: 18888)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !259, file: !181, line: 180, baseType: !295, size: 80, offset: 18896)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 80, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 10)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !259, file: !181, line: 183, baseType: !203, size: 64, offset: 19008)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !259, file: !181, line: 184, baseType: !203, size: 64, offset: 19072)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !259, file: !181, line: 185, baseType: !203, size: 64, offset: 19136)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !259, file: !181, line: 186, baseType: !203, size: 64, offset: 19200)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !259, file: !181, line: 188, baseType: !203, size: 64, offset: 19264)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !259, file: !181, line: 189, baseType: !205, size: 64, offset: 19328)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !259, file: !181, line: 190, baseType: !203, size: 64, offset: 19392)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !259, file: !181, line: 191, baseType: !203, size: 64, offset: 19456)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !259, file: !181, line: 197, baseType: !205, size: 64, offset: 19520)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !259, file: !181, line: 199, baseType: !203, size: 64, offset: 19584)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !259, file: !181, line: 200, baseType: !203, size: 64, offset: 19648)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !259, file: !181, line: 202, baseType: !310, size: 64, offset: 19712)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !273)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !259, file: !181, line: 205, baseType: !314, size: 32, offset: 19776)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !259, file: !181, line: 206, baseType: !314, size: 32, offset: 19808)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !259, file: !181, line: 207, baseType: !45, size: 32, offset: 19840)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !259, file: !181, line: 208, baseType: !45, size: 32, offset: 19872)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !259, file: !181, line: 213, baseType: !29, size: 64, offset: 19904)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !259, file: !181, line: 214, baseType: !29, size: 64, offset: 19968)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !259, file: !181, line: 215, baseType: !29, size: 64, offset: 20032)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !259, file: !181, line: 216, baseType: !29, size: 64, offset: 20096)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !259, file: !181, line: 217, baseType: !29, size: 64, offset: 20160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !259, file: !181, line: 218, baseType: !29, size: 64, offset: 20224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !259, file: !181, line: 219, baseType: !29, size: 64, offset: 20288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !259, file: !181, line: 220, baseType: !29, size: 64, offset: 20352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !259, file: !181, line: 221, baseType: !29, size: 64, offset: 20416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !259, file: !181, line: 222, baseType: !29, size: 64, offset: 20480)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !259, file: !181, line: 223, baseType: !29, size: 64, offset: 20544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !259, file: !181, line: 226, baseType: !29, size: 64, offset: 20608)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !259, file: !181, line: 227, baseType: !29, size: 64, offset: 20672)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !259, file: !181, line: 228, baseType: !29, size: 64, offset: 20736)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !259, file: !181, line: 231, baseType: !29, size: 64, offset: 20800)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !259, file: !181, line: 232, baseType: !29, size: 64, offset: 20864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !259, file: !181, line: 233, baseType: !29, size: 64, offset: 20928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !259, file: !181, line: 234, baseType: !29, size: 64, offset: 20992)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !259, file: !181, line: 235, baseType: !29, size: 64, offset: 21056)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !259, file: !181, line: 236, baseType: !29, size: 64, offset: 21120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !259, file: !181, line: 237, baseType: !29, size: 64, offset: 21184)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !259, file: !181, line: 238, baseType: !29, size: 64, offset: 21248)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !259, file: !181, line: 239, baseType: !29, size: 64, offset: 21312)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !259, file: !181, line: 240, baseType: !29, size: 64, offset: 21376)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !259, file: !181, line: 241, baseType: !29, size: 64, offset: 21440)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !259, file: !181, line: 242, baseType: !29, size: 64, offset: 21504)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !259, file: !181, line: 243, baseType: !29, size: 64, offset: 21568)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !259, file: !181, line: 244, baseType: !29, size: 64, offset: 21632)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !259, file: !181, line: 245, baseType: !29, size: 64, offset: 21696)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !259, file: !181, line: 246, baseType: !29, size: 64, offset: 21760)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !259, file: !181, line: 247, baseType: !29, size: 64, offset: 21824)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !259, file: !181, line: 248, baseType: !29, size: 64, offset: 21888)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !259, file: !181, line: 249, baseType: !29, size: 64, offset: 21952)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !259, file: !181, line: 250, baseType: !29, size: 64, offset: 22016)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !259, file: !181, line: 251, baseType: !29, size: 64, offset: 22080)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !259, file: !181, line: 253, baseType: !29, size: 64, offset: 22144)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !259, file: !181, line: 256, baseType: !29, size: 64, offset: 22208)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !259, file: !181, line: 257, baseType: !29, size: 64, offset: 22272)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !259, file: !181, line: 258, baseType: !29, size: 64, offset: 22336)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !259, file: !181, line: 259, baseType: !29, size: 64, offset: 22400)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !259, file: !181, line: 260, baseType: !29, size: 64, offset: 22464)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !259, file: !181, line: 261, baseType: !29, size: 64, offset: 22528)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !259, file: !181, line: 262, baseType: !29, size: 64, offset: 22592)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !259, file: !181, line: 264, baseType: !29, size: 64, offset: 22656)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !259, file: !181, line: 265, baseType: !29, size: 64, offset: 22720)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !259, file: !181, line: 266, baseType: !29, size: 64, offset: 22784)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !259, file: !181, line: 267, baseType: !29, size: 64, offset: 22848)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !259, file: !181, line: 268, baseType: !29, size: 64, offset: 22912)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !259, file: !181, line: 269, baseType: !29, size: 64, offset: 22976)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !259, file: !181, line: 270, baseType: !29, size: 64, offset: 23040)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !259, file: !181, line: 272, baseType: !29, size: 64, offset: 23104)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !259, file: !181, line: 273, baseType: !29, size: 64, offset: 23168)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !259, file: !181, line: 274, baseType: !29, size: 64, offset: 23232)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !259, file: !181, line: 275, baseType: !29, size: 64, offset: 23296)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !259, file: !181, line: 276, baseType: !29, size: 64, offset: 23360)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !259, file: !181, line: 277, baseType: !29, size: 64, offset: 23424)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !259, file: !181, line: 278, baseType: !29, size: 64, offset: 23488)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !259, file: !181, line: 279, baseType: !29, size: 64, offset: 23552)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !259, file: !181, line: 280, baseType: !29, size: 64, offset: 23616)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !259, file: !181, line: 281, baseType: !29, size: 64, offset: 23680)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !259, file: !181, line: 282, baseType: !29, size: 64, offset: 23744)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !259, file: !181, line: 283, baseType: !29, size: 64, offset: 23808)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !259, file: !181, line: 285, baseType: !29, size: 64, offset: 23872)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !259, file: !181, line: 286, baseType: !29, size: 64, offset: 23936)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !259, file: !181, line: 287, baseType: !29, size: 64, offset: 24000)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !259, file: !181, line: 288, baseType: !29, size: 64, offset: 24064)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !259, file: !181, line: 289, baseType: !29, size: 64, offset: 24128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !259, file: !181, line: 290, baseType: !29, size: 64, offset: 24192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !259, file: !181, line: 291, baseType: !29, size: 64, offset: 24256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !259, file: !181, line: 292, baseType: !29, size: 64, offset: 24320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !259, file: !181, line: 293, baseType: !29, size: 64, offset: 24384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !259, file: !181, line: 294, baseType: !29, size: 64, offset: 24448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !259, file: !181, line: 295, baseType: !29, size: 64, offset: 24512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !259, file: !181, line: 296, baseType: !29, size: 64, offset: 24576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !259, file: !181, line: 298, baseType: !29, size: 64, offset: 24640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !259, file: !181, line: 299, baseType: !29, size: 64, offset: 24704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !259, file: !181, line: 301, baseType: !29, size: 64, offset: 24768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !259, file: !181, line: 302, baseType: !29, size: 64, offset: 24832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !259, file: !181, line: 303, baseType: !29, size: 64, offset: 24896)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !259, file: !181, line: 304, baseType: !29, size: 64, offset: 24960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !259, file: !181, line: 305, baseType: !29, size: 64, offset: 25024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !259, file: !181, line: 307, baseType: !29, size: 64, offset: 25088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !259, file: !181, line: 308, baseType: !29, size: 64, offset: 25152)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !259, file: !181, line: 309, baseType: !29, size: 64, offset: 25216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !259, file: !181, line: 310, baseType: !29, size: 64, offset: 25280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !259, file: !181, line: 311, baseType: !29, size: 64, offset: 25344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !259, file: !181, line: 316, baseType: !29, size: 64, offset: 25408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !259, file: !181, line: 317, baseType: !29, size: 64, offset: 25472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !259, file: !181, line: 318, baseType: !29, size: 64, offset: 25536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !259, file: !181, line: 319, baseType: !29, size: 64, offset: 25600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !259, file: !181, line: 322, baseType: !409, size: 896, offset: 25664)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !181, line: 149, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 111, size: 896, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !437, !438}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !410, file: !181, line: 112, baseType: !207, size: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !410, file: !181, line: 113, baseType: !207, size: 16, offset: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !410, file: !181, line: 114, baseType: !207, size: 16, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !410, file: !181, line: 115, baseType: !207, size: 16, offset: 48)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !410, file: !181, line: 116, baseType: !207, size: 16, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !410, file: !181, line: 117, baseType: !207, size: 16, offset: 80)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !410, file: !181, line: 118, baseType: !207, size: 16, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !410, file: !181, line: 119, baseType: !207, size: 16, offset: 112)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !410, file: !181, line: 120, baseType: !207, size: 16, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !410, file: !181, line: 121, baseType: !207, size: 16, offset: 144)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !410, file: !181, line: 122, baseType: !207, size: 16, offset: 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !410, file: !181, line: 123, baseType: !207, size: 16, offset: 176)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !410, file: !181, line: 124, baseType: !207, size: 16, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !410, file: !181, line: 125, baseType: !207, size: 16, offset: 208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !410, file: !181, line: 127, baseType: !207, size: 16, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !410, file: !181, line: 128, baseType: !207, size: 16, offset: 240)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !410, file: !181, line: 130, baseType: !205, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !410, file: !181, line: 131, baseType: !205, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !410, file: !181, line: 132, baseType: !205, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !410, file: !181, line: 135, baseType: !205, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !410, file: !181, line: 138, baseType: !205, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !410, file: !181, line: 141, baseType: !205, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !410, file: !181, line: 142, baseType: !205, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !410, file: !181, line: 145, baseType: !436, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !410, file: !181, line: 146, baseType: !436, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !410, file: !181, line: 148, baseType: !207, size: 16, offset: 832)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !177, file: !212, line: 380, type: !257, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "utf8", scope: !177, file: !212, line: 387, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !288)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "ascii", scope: !177, file: !212, line: 388, type: !443, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "__code2flag", scope: !177, file: !212, line: 854, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 256, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 16)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !181, line: 324, baseType: !259)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !454, file: !455, line: 131, type: !499, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !456, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!456 = !{!457, !489, !491, !493, !495, !497, !452}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "stdin", scope: !454, file: !455, line: 154, type: !459, isLocal: false, isDefinition: true)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !461, line: 46, baseType: !462)
!461 = !DIFile(filename: "./include/stdio.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !463, line: 233, size: 704, elements: !464)
!463 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!464 = !{!465, !466, !470, !471, !472, !473, !474, !475, !476, !477, !479, !481, !488}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !462, file: !463, line: 234, baseType: !94, size: 16)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !462, file: !463, line: 237, baseType: !467, size: 16, offset: 16)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 2)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !462, file: !463, line: 244, baseType: !45, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !462, file: !463, line: 246, baseType: !209, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !462, file: !463, line: 247, baseType: !209, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !462, file: !463, line: 248, baseType: !209, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !462, file: !463, line: 249, baseType: !209, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !462, file: !463, line: 252, baseType: !209, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !462, file: !463, line: 255, baseType: !209, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !462, file: !463, line: 261, baseType: !478, size: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !462, file: !463, line: 268, baseType: !480, size: 64, offset: 512)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !468)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !462, file: !463, line: 271, baseType: !482, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !483, line: 85, baseType: !484)
!483 = !DIFile(filename: "./include/wchar.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !483, line: 81, size: 64, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !484, file: !483, line: 83, baseType: !314, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !484, file: !483, line: 84, baseType: !314, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !462, file: !463, line: 274, baseType: !6, size: 64, offset: 640)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "stdout", scope: !454, file: !455, line: 155, type: !459, isLocal: false, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "stderr", scope: !454, file: !455, line: 156, type: !459, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "__stdin", scope: !454, file: !455, line: 159, type: !459, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__stdout", scope: !454, file: !455, line: 162, type: !459, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !454, file: !455, line: 180, type: !459, isLocal: false, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 2112, elements: !137)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !502, file: !503, line: 49, type: !45, isLocal: true, isDefinition: true)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !504, globals: !518, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "libc/stdlib/abort.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!504 = !{!505, !6, !514}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !507, line: 50, baseType: !508)
!507 = !DIFile(filename: "./include/signal.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !509, line: 31, baseType: !510)
!509 = !DIFile(filename: "./include/bits/sigset.h", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 28, size: 1024, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !510, file: !509, line: 30, baseType: !513, size: 1024)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !449)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !507, line: 75, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !45}
!518 = !{!500}
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !521, file: !524, line: 309, type: !515, isLocal: false, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !523, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!523 = !{!519}
!524 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/mdshafiuzzaman/Research/KLEE/klee-uclibc")
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "mSmmMemLibInternalMaximumSupportAddress", scope: !527, file: !733, line: 43, type: !630, isLocal: false, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !529, retainedTypes: !608, globals: !730, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "klee_driver.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!529 = !{!530, !541, !561, !567, !574, !579, !582, !587, !594, !602}
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 21, baseType: !62, size: 32, elements: !532)
!531 = !DIFile(filename: "edk2/MdePkg/Include/Pi/PiDxeCis.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540}
!533 = !DIEnumerator(name: "EfiGcdMemoryTypeNonExistent", value: 0)
!534 = !DIEnumerator(name: "EfiGcdMemoryTypeReserved", value: 1)
!535 = !DIEnumerator(name: "EfiGcdMemoryTypeSystemMemory", value: 2)
!536 = !DIEnumerator(name: "EfiGcdMemoryTypeMemoryMappedIo", value: 3)
!537 = !DIEnumerator(name: "EfiGcdMemoryTypePersistent", value: 4)
!538 = !DIEnumerator(name: "EfiGcdMemoryTypePersistentMemory", value: 4)
!539 = !DIEnumerator(name: "EfiGcdMemoryTypeMoreReliable", value: 5)
!540 = !DIEnumerator(name: "EfiGcdMemoryTypeMaximum", value: 7)
!541 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !542, line: 38, baseType: !62, size: 32, elements: !543)
!542 = !DIFile(filename: "edk2/MdePkg/Include/Uefi/UefiMultiPhase.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!544 = !DIEnumerator(name: "EfiReservedMemoryType", value: 0)
!545 = !DIEnumerator(name: "EfiLoaderCode", value: 1)
!546 = !DIEnumerator(name: "EfiLoaderData", value: 2)
!547 = !DIEnumerator(name: "EfiBootServicesCode", value: 3)
!548 = !DIEnumerator(name: "EfiBootServicesData", value: 4)
!549 = !DIEnumerator(name: "EfiRuntimeServicesCode", value: 5)
!550 = !DIEnumerator(name: "EfiRuntimeServicesData", value: 6)
!551 = !DIEnumerator(name: "EfiConventionalMemory", value: 7)
!552 = !DIEnumerator(name: "EfiUnusableMemory", value: 8)
!553 = !DIEnumerator(name: "EfiACPIReclaimMemory", value: 9)
!554 = !DIEnumerator(name: "EfiACPIMemoryNVS", value: 10)
!555 = !DIEnumerator(name: "EfiMemoryMappedIO", value: 11)
!556 = !DIEnumerator(name: "EfiMemoryMappedIOPortSpace", value: 12)
!557 = !DIEnumerator(name: "EfiPalCode", value: 13)
!558 = !DIEnumerator(name: "EfiPersistentMemory", value: 14)
!559 = !DIEnumerator(name: "EfiUnacceptedMemoryType", value: 15)
!560 = !DIEnumerator(name: "EfiMaxMemoryType", value: 16)
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !542, line: 117, baseType: !62, size: 32, elements: !562)
!562 = !{!563, !564, !565, !566}
!563 = !DIEnumerator(name: "EfiResetCold", value: 0)
!564 = !DIEnumerator(name: "EfiResetWarm", value: 1)
!565 = !DIEnumerator(name: "EfiResetShutdown", value: 2)
!566 = !DIEnumerator(name: "EfiResetPlatformSpecific", value: 3)
!567 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 29, baseType: !62, size: 32, elements: !569)
!568 = !DIFile(filename: "edk2/MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!569 = !{!570, !571, !572, !573}
!570 = !DIEnumerator(name: "AllocateAnyPages", value: 0)
!571 = !DIEnumerator(name: "AllocateMaxAddress", value: 1)
!572 = !DIEnumerator(name: "AllocateAddress", value: 2)
!573 = !DIEnumerator(name: "MaxAllocateType", value: 3)
!574 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 506, baseType: !62, size: 32, elements: !575)
!575 = !{!576, !577, !578}
!576 = !DIEnumerator(name: "TimerCancel", value: 0)
!577 = !DIEnumerator(name: "TimerPeriodic", value: 1)
!578 = !DIEnumerator(name: "TimerRelative", value: 2)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 1144, baseType: !62, size: 32, elements: !580)
!580 = !{!581}
!581 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!582 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 1460, baseType: !62, size: 32, elements: !583)
!583 = !{!584, !585, !586}
!584 = !DIEnumerator(name: "AllHandles", value: 0)
!585 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!586 = !DIEnumerator(name: "ByProtocol", value: 2)
!587 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !588, line: 24, baseType: !62, size: 32, elements: !589)
!588 = !DIFile(filename: "edk2/MdePkg/Include/Protocol/MmCpuIo.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!589 = !{!590, !591, !592, !593}
!590 = !DIEnumerator(name: "MM_IO_UINT8", value: 0)
!591 = !DIEnumerator(name: "MM_IO_UINT16", value: 1)
!592 = !DIEnumerator(name: "MM_IO_UINT32", value: 2)
!593 = !DIEnumerator(name: "MM_IO_UINT64", value: 3)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 95, baseType: !62, size: 32, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601}
!596 = !DIEnumerator(name: "EfiGcdAllocateAnySearchBottomUp", value: 0)
!597 = !DIEnumerator(name: "EfiGcdAllocateMaxAddressSearchBottomUp", value: 1)
!598 = !DIEnumerator(name: "EfiGcdAllocateAddress", value: 2)
!599 = !DIEnumerator(name: "EfiGcdAllocateAnySearchTopDown", value: 3)
!600 = !DIEnumerator(name: "EfiGcdAllocateMaxAddressSearchTopDown", value: 4)
!601 = !DIEnumerator(name: "EfiGcdMaxAllocateType", value: 5)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 73, baseType: !62, size: 32, elements: !603)
!603 = !{!604, !605, !606, !607}
!604 = !DIEnumerator(name: "EfiGcdIoTypeNonExistent", value: 0)
!605 = !DIEnumerator(name: "EfiGcdIoTypeReserved", value: 1)
!606 = !DIEnumerator(name: "EfiGcdIoTypeIo", value: 2)
!607 = !DIEnumerator(name: "EfiGcdIoTypeMaximum", value: 3)
!608 = !{!6, !609, !625, !629, !630, !633, !634, !644, !645, !647, !649, !650, !651, !653, !655, !656, !658, !682, !632, !698, !699, !706, !715, !723, !728, !729, !623}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HOB_CPU", file: !611, line: 462, baseType: !612)
!611 = !DIFile(filename: "edk2/MdePkg/Include/Pi/PiHob.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 445, size: 128, elements: !613)
!613 = !{!614, !624, !626, !627}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !612, file: !611, line: 449, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HOB_GENERIC_HEADER", file: !611, line: 49, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 36, size: 64, elements: !617)
!617 = !{!618, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "HobType", scope: !616, file: !611, line: 40, baseType: !619, size: 16)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !620, line: 105, baseType: !94)
!620 = !DIFile(filename: "edk2/MdePkg/Include/Arm/ProcessorBind.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!621 = !DIDerivedType(tag: DW_TAG_member, name: "HobLength", scope: !616, file: !611, line: 44, baseType: !619, size: 16, offset: 16)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !616, file: !611, line: 48, baseType: !623, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !620, line: 103, baseType: !62)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfMemorySpace", scope: !612, file: !611, line: 453, baseType: !625, size: 8, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !620, line: 109, baseType: !96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfIoSpace", scope: !612, file: !611, line: 457, baseType: !625, size: 8, offset: 72)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !612, file: !611, line: 461, baseType: !628, size: 48, offset: 80)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 48, elements: !288)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !620, line: 108, baseType: !96)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !631, line: 50, baseType: !632)
!631 = !DIFile(filename: "edk2/MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !620, line: 101, baseType: !25)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !620, line: 118, baseType: !623)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !568, line: 160, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 128, size: 320, elements: !637)
!637 = !{!638, !639, !640, !642, !643}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !636, file: !568, line: 134, baseType: !623, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !636, file: !568, line: 140, baseType: !630, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !636, file: !568, line: 146, baseType: !641, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !631, line: 55, baseType: !632)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !636, file: !568, line: 153, baseType: !632, size: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !636, file: !568, line: 159, baseType: !632, size: 64, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !646, line: 1026, baseType: !633)
!646 = !DIFile(filename: "edk2/MdePkg/Include/Base.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !620, line: 124, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !620, line: 104, baseType: !45)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_COMMUNICATE_HEADER", file: !660, line: 17, baseType: !661)
!660 = !DIFile(filename: "edk2/MdePkg/Include/Protocol/SmmCommunication.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_COMMUNICATE_HEADER", file: !662, line: 34, baseType: !663)
!662 = !DIFile(filename: "edk2/MdePkg/Include/Protocol/MmCommunication.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !662, line: 21, size: 168, elements: !664)
!664 = !{!665, !677, !678}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderGuid", scope: !663, file: !662, line: 25, baseType: !666, size: 128)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !631, line: 25, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !646, line: 218, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !646, line: 213, size: 128, elements: !669)
!669 = !{!670, !671, !672, !673}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !668, file: !646, line: 214, baseType: !623, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !668, file: !646, line: 215, baseType: !619, size: 16, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !668, file: !646, line: 216, baseType: !619, size: 16, offset: 48)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !668, file: !646, line: 217, baseType: !674, size: 64, offset: 64)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 64, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 8)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "MessageLength", scope: !663, file: !662, line: 29, baseType: !633, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !663, file: !662, line: 33, baseType: !679, size: 8, offset: 160)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 8, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 1)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_SAVE", file: !684, line: 37, baseType: !685)
!684 = !DIFile(filename: "edk2/MdeModulePkg/Include/Guid/SmmLockBox.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 32, size: 384, elements: !686)
!686 = !{!687, !694, !695, !697}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !685, file: !684, line: 33, baseType: !688, size: 128)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_HEADER", file: !684, line: 30, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 26, size: 128, elements: !690)
!690 = !{!691, !692, !693}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Command", scope: !689, file: !684, line: 27, baseType: !623, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !689, file: !684, line: 28, baseType: !623, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnStatus", scope: !689, file: !684, line: 29, baseType: !632, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !685, file: !684, line: 34, baseType: !667, size: 128, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !685, file: !684, line: 35, baseType: !696, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_ADDRESS", file: !646, line: 237, baseType: !632)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !685, file: !684, line: 36, baseType: !632, size: 64, offset: 320)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !631, line: 29, baseType: !645)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_SET_ATTRIBUTES", file: !684, line: 58, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 54, size: 320, elements: !702)
!702 = !{!703, !704, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !701, file: !684, line: 55, baseType: !688, size: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !701, file: !684, line: 56, baseType: !667, size: 128, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !701, file: !684, line: 57, baseType: !632, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_UPDATE", file: !684, line: 45, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 39, size: 448, elements: !709)
!709 = !{!710, !711, !712, !713, !714}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !708, file: !684, line: 40, baseType: !688, size: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !708, file: !684, line: 41, baseType: !667, size: 128, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !708, file: !684, line: 42, baseType: !632, size: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !708, file: !684, line: 43, baseType: !696, size: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !708, file: !684, line: 44, baseType: !632, size: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_RESTORE", file: !684, line: 52, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 47, size: 384, elements: !718)
!718 = !{!719, !720, !721, !722}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !717, file: !684, line: 48, baseType: !688, size: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !717, file: !684, line: 49, baseType: !667, size: 128, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !717, file: !684, line: 50, baseType: !696, size: 64, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !717, file: !684, line: 51, baseType: !632, size: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_RESTORE_ALL_IN_PLACE", file: !684, line: 62, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 60, size: 128, elements: !726)
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !725, file: !684, line: 61, baseType: !688, size: 128)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!730 = !{!525, !731, !747, !749, !760, !762, !765, !780, !782, !931, !976, !1185, !1281, !1393, !1486, !1489, !1500, !1502, !1504, !1506, !1508, !1510, !1512, !1515, !1517, !1519, !1521, !1523, !1525, !1527, !1529, !1531, !1533, !1535, !1537, !1539, !1541, !1543, !1545, !1547, !1549, !1551, !1553, !1555, !1557, !1559, !1561, !1563, !1565, !1567, !1569, !1571, !1573, !1575, !1577, !1579, !1581, !1583, !1585, !1587, !1589, !1591, !1593, !1595, !1597, !1599, !1601, !1603, !1605, !1607, !1609}
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "mSmmMemLibGcdMemSpace", scope: !527, file: !733, line: 49, type: !734, isLocal: false, isDefinition: true)
!733 = !DIFile(filename: "./edk2/MdePkg/Library/SmmMemLib/SmmMemLib.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GCD_MEMORY_SPACE_DESCRIPTOR", file: !531, line: 173, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 127, size: 448, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !744, !746}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "BaseAddress", scope: !736, file: !531, line: 133, baseType: !630, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !736, file: !531, line: 138, baseType: !632, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Capabilities", scope: !736, file: !531, line: 145, baseType: !632, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !736, file: !531, line: 150, baseType: !632, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "GcdMemoryType", scope: !736, file: !531, line: 155, baseType: !743, size: 32, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GCD_MEMORY_TYPE", file: !531, line: 68, baseType: !530)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ImageHandle", scope: !736, file: !531, line: 163, baseType: !745, size: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !631, line: 33, baseType: !6)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceHandle", scope: !736, file: !531, line: 172, baseType: !745, size: 64, offset: 384)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "mSmmMemLibGcdMemNumberOfDesc", scope: !527, file: !733, line: 50, type: !633, isLocal: false, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "mSmmMemLibMemoryAttributesTable", scope: !527, file: !733, line: 52, type: !751, isLocal: false, isDefinition: true)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_ATTRIBUTES_TABLE", file: !753, line: 22, baseType: !754)
!753 = !DIFile(filename: "edk2/MdePkg/Include/Guid/MemoryAttributesTable.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !753, line: 16, size: 128, elements: !755)
!755 = !{!756, !757, !758, !759}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !754, file: !753, line: 17, baseType: !623, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfEntries", scope: !754, file: !753, line: 18, baseType: !623, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "DescriptorSize", scope: !754, file: !753, line: 19, baseType: !623, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !754, file: !753, line: 20, baseType: !623, size: 32, offset: 96)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "mSmmMemLibSmmReadyToLock", scope: !527, file: !733, line: 57, type: !629, isLocal: false, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "mMmMemLibInternalMaximumSupportAddress", scope: !527, file: !764, line: 28, type: !630, isLocal: false, isDefinition: true)
!764 = !DIFile(filename: "./edk2/StandaloneMmPkg/Library/StandaloneMmMemLib/StandaloneMmMemLib.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "mLockBoxSmmCommProtocol", scope: !527, file: !767, line: 23, type: !768, isLocal: false, isDefinition: true)
!767 = !DIFile(filename: "./edk2/MdeModulePkg/Library/SmmLockBoxLib/SmmLockBoxDxeLib.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_COMMUNICATION_PROTOCOL", file: !660, line: 21, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_COMMUNICATION_PROTOCOL", file: !662, line: 43, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MM_COMMUNICATION_PROTOCOL", file: !662, line: 80, size: 64, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Communicate", scope: !771, file: !662, line: 81, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_COMMUNICATE", file: !662, line: 70, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!698, !778, !6, !728}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !770)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "mLockBoxSmmCommBuffer", scope: !527, file: !767, line: 24, type: !644, isLocal: false, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "gMmst", scope: !527, file: !528, line: 50, type: !784, isLocal: false, isDefinition: true)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_SYSTEM_TABLE", file: !786, line: 16, baseType: !787)
!786 = !DIFile(filename: "edk2/MdePkg/Include/Pi/PiMmCis.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MM_SYSTEM_TABLE", file: !786, line: 252, size: 1856, elements: !788)
!788 = !{!789, !798, !801, !802, !811, !829, !835, !840, !847, !852, !862, !863, !864, !865, !866, !867, !874, !882, !887, !892, !901, !907, !912, !917, !926}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !787, file: !786, line: 256, baseType: !790, size: 192)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TABLE_HEADER", file: !542, line: 177, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 150, size: 192, elements: !792)
!792 = !{!793, !794, !795, !796, !797}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !791, file: !542, line: 156, baseType: !632, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !791, file: !542, line: 163, baseType: !623, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !791, file: !542, line: 167, baseType: !623, size: 32, offset: 96)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "CRC32", scope: !791, file: !542, line: 172, baseType: !623, size: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !791, file: !542, line: 176, baseType: !623, size: 32, offset: 160)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "MmFirmwareVendor", scope: !787, file: !786, line: 261, baseType: !799, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !620, line: 106, baseType: !94)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "MmFirmwareRevision", scope: !787, file: !786, line: 265, baseType: !623, size: 32, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "MmInstallConfigurationTable", scope: !787, file: !786, line: 267, baseType: !803, size: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_INSTALL_CONFIGURATION_TABLE", file: !786, line: 49, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!698, !807, !809, !6, !633}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "MmIo", scope: !787, file: !786, line: 272, baseType: !812, size: 256, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_CPU_IO_PROTOCOL", file: !588, line: 19, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MM_CPU_IO_PROTOCOL", file: !588, line: 77, size: 256, elements: !814)
!814 = !{!815, !828}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Mem", scope: !813, file: !588, line: 81, baseType: !816, size: 128)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_IO_ACCESS", file: !588, line: 72, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 63, size: 128, elements: !818)
!818 = !{!819, !827}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !817, file: !588, line: 67, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_CPU_IO", file: !588, line: 55, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!698, !824, !826, !632, !633, !6}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !812)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_IO_WIDTH", file: !588, line: 29, baseType: !587)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !817, file: !588, line: 71, baseType: !820, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Io", scope: !813, file: !588, line: 85, baseType: !816, size: 128, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "MmAllocatePool", scope: !787, file: !786, line: 277, baseType: !830, size: 64, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_POOL", file: !568, line: 270, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!698, !834, !633, !649}
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_TYPE", file: !542, line: 112, baseType: !541)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "MmFreePool", scope: !787, file: !786, line: 278, baseType: !836, size: 64, offset: 704)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_POOL", file: !568, line: 287, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!698, !6}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "MmAllocatePages", scope: !787, file: !786, line: 279, baseType: !841, size: 64, offset: 768)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_PAGES", file: !568, line: 188, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!698, !845, !834, !633, !846}
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_TYPE", file: !568, line: 47, baseType: !567)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "MmFreePages", scope: !787, file: !786, line: 280, baseType: !848, size: 64, offset: 832)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_PAGES", file: !568, line: 209, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!698, !630, !633}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "MmStartupThisAp", scope: !787, file: !786, line: 285, baseType: !853, size: 64, offset: 896)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_STARTUP_THIS_AP", file: !786, line: 74, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!698, !857, !633, !6}
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_AP_PROCEDURE", file: !858, line: 191, baseType: !859)
!858 = !DIFile(filename: "edk2/MdePkg/Include/Pi/PiMultiPhase.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !6}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentlyExecutingCpu", scope: !787, file: !786, line: 295, baseType: !633, size: 32, offset: 960)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfCpus", scope: !787, file: !786, line: 299, baseType: !633, size: 32, offset: 992)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveStateSize", scope: !787, file: !786, line: 305, baseType: !728, size: 64, offset: 1024)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveState", scope: !787, file: !786, line: 311, baseType: !649, size: 64, offset: 1088)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !787, file: !786, line: 320, baseType: !633, size: 32, offset: 1152)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "MmConfigurationTable", scope: !787, file: !786, line: 325, baseType: !868, size: 64, offset: 1216)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONFIGURATION_TABLE", file: !568, line: 1972, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 1963, size: 192, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !870, file: !568, line: 1967, baseType: !666, size: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "VendorTable", scope: !870, file: !568, line: 1971, baseType: !6, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "MmInstallProtocolInterface", scope: !787, file: !786, line: 330, baseType: !875, size: 64, offset: 1280)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_PROTOCOL_INTERFACE", file: !568, line: 1173, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!698, !879, !880, !881, !6}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INTERFACE_TYPE", file: !568, line: 1149, baseType: !579)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "MmUninstallProtocolInterface", scope: !787, file: !786, line: 331, baseType: !883, size: 64, offset: 1344)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_PROTOCOL_INTERFACE", file: !568, line: 1249, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!698, !745, !880, !6}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "MmHandleProtocol", scope: !787, file: !786, line: 332, baseType: !888, size: 64, offset: 1408)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE_PROTOCOL", file: !568, line: 1290, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!698, !745, !880, !649}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "MmRegisterProtocolNotify", scope: !787, file: !786, line: 333, baseType: !893, size: 64, offset: 1472)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_REGISTER_PROTOCOL_NOTIFY", file: !786, line: 117, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!698, !809, !897, !649}
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_NOTIFY_FN", file: !786, line: 91, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!698, !809, !6, !745}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "MmLocateHandle", scope: !787, file: !786, line: 334, baseType: !902, size: 64, offset: 1536)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE", file: !568, line: 1500, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!698, !906, !880, !6, !728, !879}
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_SEARCH_TYPE", file: !568, line: 1474, baseType: !582)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "MmLocateProtocol", scope: !787, file: !786, line: 335, baseType: !908, size: 64, offset: 1600)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_PROTOCOL", file: !568, line: 1600, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!698, !880, !6, !649}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "MmiManage", scope: !787, file: !786, line: 340, baseType: !913, size: 64, offset: 1664)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_INTERRUPT_MANAGE", file: !786, line: 138, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!698, !809, !152, !6, !728}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "MmiHandlerRegister", scope: !787, file: !786, line: 341, baseType: !918, size: 64, offset: 1728)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_INTERRUPT_REGISTER", file: !786, line: 185, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!698, !922, !809, !879}
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_HANDLER_ENTRY_POINT", file: !786, line: 165, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!698, !745, !152, !6, !728}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "MmiHandlerUnRegister", scope: !787, file: !786, line: 342, baseType: !927, size: 64, offset: 1792)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_INTERRUPT_UNREGISTER", file: !786, line: 201, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!698, !745}
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "gSmst", scope: !527, file: !528, line: 51, type: !933, isLocal: false, isDefinition: true)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_SYSTEM_TABLE2", file: !935, line: 16, baseType: !936)
!935 = !DIFile(filename: "edk2/MdePkg/Include/Pi/PiSmmCis.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SMM_SYSTEM_TABLE2", file: !935, line: 107, size: 1856, elements: !937)
!937 = !{!938, !939, !940, !941, !948, !951, !952, !953, !954, !955, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !968, !969, !970, !972, !974}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !936, file: !935, line: 111, baseType: !790, size: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "SmmFirmwareVendor", scope: !936, file: !935, line: 116, baseType: !799, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "SmmFirmwareRevision", scope: !936, file: !935, line: 120, baseType: !623, size: 32, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "SmmInstallConfigurationTable", scope: !936, file: !935, line: 122, baseType: !942, size: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_INSTALL_CONFIGURATION_TABLE2", file: !935, line: 45, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!698, !946, !809, !6, !633}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "SmmIo", scope: !936, file: !935, line: 127, baseType: !949, size: 256, offset: 384)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_CPU_IO2_PROTOCOL", file: !950, line: 18, baseType: !812)
!950 = !DIFile(filename: "edk2/MdePkg/Include/Protocol/SmmCpuIo2.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/stase-edk2")
!951 = !DIDerivedType(tag: DW_TAG_member, name: "SmmAllocatePool", scope: !936, file: !935, line: 132, baseType: !830, size: 64, offset: 640)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "SmmFreePool", scope: !936, file: !935, line: 133, baseType: !836, size: 64, offset: 704)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "SmmAllocatePages", scope: !936, file: !935, line: 134, baseType: !841, size: 64, offset: 768)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "SmmFreePages", scope: !936, file: !935, line: 135, baseType: !848, size: 64, offset: 832)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "SmmStartupThisAp", scope: !936, file: !935, line: 140, baseType: !956, size: 64, offset: 896)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_STARTUP_THIS_AP", file: !935, line: 52, baseType: !853)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentlyExecutingCpu", scope: !936, file: !935, line: 150, baseType: !633, size: 32, offset: 960)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfCpus", scope: !936, file: !935, line: 154, baseType: !633, size: 32, offset: 992)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveStateSize", scope: !936, file: !935, line: 160, baseType: !728, size: 64, offset: 1024)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveState", scope: !936, file: !935, line: 166, baseType: !649, size: 64, offset: 1088)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !936, file: !935, line: 175, baseType: !633, size: 32, offset: 1152)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "SmmConfigurationTable", scope: !936, file: !935, line: 180, baseType: !868, size: 64, offset: 1216)
